In [1]:
#Import Libraries
import numpy as np 

import pandas as pd

In [37]:
dic = { "Rank":[ 5,  2,  8,  6,  9,  4,  7, 10,  1,  3],
"score":[60,80,None,55,40,70,65,None,90,None],
"First_Term":[52, 51, None, 99, 73,  7, 77, 95, 81, 39],
"Second_Term":[61, 50,  5, None, 63, 83, 40, None, 28, 92],
"Third_Term":[14, 87, 49, 12, None, 16, None,None, 35, 86]

}

In [38]:
data = pd.DataFrame(dic)
data

   Rank  score  First_Term  Second_Term  Third_Term
0     5   60.0        52.0         61.0        14.0
1     2   80.0        51.0         50.0        87.0
2     8    NaN         NaN          5.0        49.0
3     6   55.0        99.0          NaN        12.0
4     9   40.0        73.0         63.0         NaN
5     4   70.0         7.0         83.0        16.0
6     7   65.0        77.0         40.0         NaN
7    10    NaN        95.0          NaN         NaN
8     1   90.0        81.0         28.0        35.0
9     3    NaN        39.0         92.0        86.0

In [39]:
#By using we can find whether the data has null values or not
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Rank         10 non-null     int64
 1   score        7 non-null      float64
 2   First_Term   9 non-null      float64
 3   Second_Term  8 non-null      float64
 4   Third_Term   7 non-null      float64
dtypes: float64(4), int64(1)
memory usage: 528.0 bytes

** Find Null values **

In [40]:
data.isnull()

    Rank  score  First_Term  Second_Term  Third_Term
0  False  False       False        False       False
1  False  False       False        False       False
2  False   True        True        False       False
3  False  False       False         True       False
4  False  False       False        False        True
5  False  False       False        False       False
6  False  False       False        False        True
7  False   True       False         True        True
8  False  False       False        False       False
9  False   True       False        False       False

** Find the Total Number of null values **

In [9]:
data.isnull().sum()

Rank           0
score          3
First_Term     1
Second_Term    2
Third_Term     3
dtype: int64

** Find the Null values for particular column **

In [42]:
data[data['Third_Term'].isnull()]

   Rank  score  First_Term  Second_Term  Third_Term
4     9   40.0        73.0         63.0         NaN
6     7   65.0        77.0         40.0         NaN
7    10    NaN        95.0          NaN         NaN

** Arrange the number of null values from higher to lower **

In [10]:
data.isnull().sum().sort_values(ascending=False)

Third_Term     3
score          3
Second_Term    2
First_Term     1
Rank           0
dtype: int64

** Find total number of values expect null values **

In [11]:
data.count().sort_values(ascending=True)

score           7
Third_Term      7
Second_Term     8
First_Term      9
Rank           10
dtype: int64

** Find Total number of  values including null values **

In [12]:
data.isnull().count()

Rank           10
score          10
First_Term     10
Second_Term    10
Third_Term     10
dtype: int64

** To find, howmany percentage of value are missing **

In [17]:
((data.isnull().mean())*100).sort_values(ascending=False)

Third_Term     30.0
score          30.0
Second_Term    20.0
First_Term     10.0
Rank            0.0
dtype: float64

In [18]:
#We can find another way as well

In [19]:
Total_null = data.isnull().sum().sort_values(ascending=False)
Total_null

Third_Term     3
score          3
Second_Term    2
First_Term     1
Rank           0
dtype: int64

In [20]:
Total_count = data.isnull().count()
Total_count

Rank           10
score          10
First_Term     10
Second_Term    10
Third_Term     10
dtype: int64

In [28]:
Percentage_of_null = ((Total_null/Total_count)*100).sort_values(ascending=False)
Percentage_of_null

score          30.0
Third_Term     30.0
Second_Term    20.0
First_Term     10.0
Rank            0.0
dtype: float64

** Create dataframe by using Total count,Total null values and Percentage of null values **

In [25]:
Total_null

Third_Term     3
score          3
Second_Term    2
First_Term     1
Rank           0
dtype: int64

In [26]:
Percentage_of_null

score          30.0
Third_Term     30.0
Second_Term    20.0
First_Term     10.0
Rank            0.0
dtype: float64

In [29]:
dataframe_null = pd.concat([Total_null,Percentage_of_null],axis=1,keys=['Total_Null','Percentage_of_Null'])

In [30]:
dataframe_null

             Total_Null  Percentage_of_Null
Third_Term            3                30.0
score                 3                30.0
Second_Term           2                20.0
First_Term            1                10.0
Rank                  0                 0.0

In [2]:
dic = { "Rank":[ 5,  2,  0,  6,  0,  4,  7, 0,  1,  3],
"score":[60,80,None,55,40,70,65,None,90,None],
"First_Term":[52, 51, None, 99, 73,  7, 77, 95, 81, 39],
"Second_Term":[61, 50,  5, None, 63, 83, 40, None, 28, 92],
"Third_Term":[14, 87, 49, 12, None, 16, None,None, 35, 86]

}

**Find the null values for not giving null **

In [3]:
data = pd.DataFrame(dic)
data

   Rank  score  First_Term  Second_Term  Third_Term
0     5   60.0        52.0         61.0        14.0
1     2   80.0        51.0         50.0        87.0
2     0    NaN         NaN          5.0        49.0
3     6   55.0        99.0          NaN        12.0
4     0   40.0        73.0         63.0         NaN
5     4   70.0         7.0         83.0        16.0
6     7   65.0        77.0         40.0         NaN
7     0    NaN        95.0          NaN         NaN
8     1   90.0        81.0         28.0        35.0
9     3    NaN        39.0         92.0        86.0

There are no null values in Rank. But in our data the null values is given by zero. So we should consider zero  as null values.

In [4]:
data['Rank'].isnull().sum()

0

In [6]:
data.loc[data["Rank"] == 0, "Rank"] = np.NAN

In [7]:
data['Rank'].isnull().sum()

3